In [ ]:
Q1. List any five functions of the pandas library with execution.

In [2]:
import pandas as pd

In [6]:
df=pd.read_csv("https://raw.githubusercontent.com/datasciencedojo/datasets/master/titanic.csv")

In [7]:
df

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...,...
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q

In [8]:
df1=pd.read_excel("LUSID Excel - Setting up your market data.xlsx")

In [3]:
import lxml
df3=pd.read_html("https://www.basketball-reference.com/leagues/NBA_2015_totals.html")

In [10]:
df3

[      Rk          Player Pos Age   Tm   G  GS    MP   FG  FGA  ...   FT%  ORB  \
 0      1      Quincy Acy  PF  24  NYK  68  22  1287  152  331  ...  .784   79
 1      2    Jordan Adams  SG  20  MEM  30   0   248   35   86  ...  .609    9
 2      3    Steven Adams   C  21  OKC  70  67  1771  217  399  ...  .502  199
 3      4     Jeff Adrien  PF  28  MIN  17   0   215   19   44  ...  .579   23
 4      5   Arron Afflalo  SG  29  TOT  78  72  2502  375  884  ...  .843   27
 ..   ...             ...  ..  ..  ...  ..  ..   ...  ...  ...  ...   ...  ...
 670  490  Thaddeus Young  PF  26  TOT  76  68  2434  451  968  ...  .655  127
 671  490  Thaddeus Young  PF  26  MIN  48  48  1605  289  641  ...  .682   75
 672  490  Thaddeus Young  PF  26  BRK  28  20   829  162  327  ...  .606   52
 673  491     Cody Zeller   C  22  CHO  62  45  1487  172  373  ...  .774   97
 674  492    Tyler Zeller   C  25  BOS  82  59  1731  340  619  ...  .823  146

      DRB  TRB  AST  STL BLK  TOV   PF   PTS
 0    222  301   68   27  22   60  147   398
 1     19   28   16   16   7   14   24    94
 2    324  523   66   38  86   99  222   537
 3     54   77   15    4   9    9   30    60
 4    220  247  129   41   7  116  167  1035
 ..   ...  ...  ...  ...  ..  ...  ...   ...
 670  284  411  173  124  25  117  171  1071
 671  170  245  135   86  17   75  115   685
 672  114  166   38   38   8   42   56   386
 673  265  362  100   34  49   62  156   472
 674  319  465  113   18  52   76  205   833

 [675 rows x 30 columns]]

In [16]:
pip install lxml

Collecting lxml
  Downloading lxml-4.9.3-cp310-cp310-manylinux_2_28_x86_64.whl (7.9 MB)
     ━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━ 7.9/7.9 MB 58.1 MB/s eta 0:00:0000:0100:01
Installing collected packages: lxml
Successfully installed lxml-4.9.3
Note: you may need to restart the kernel to use updated packages.

In [5]:
data=[1,2,3,4]

In [7]:
pd.Series(data)

0    1
1    2
2    3
3    4
dtype: int64

In [8]:
data1=["raju","rajnish"]

In [9]:
pd.DataFrame(data1)

         0
0     raju
1  rajnish

In [ ]:
Q2. Given a Pandas DataFrame df with columns 'A', 'B', and 'C', write a Python function to re-index the
DataFrame with a new index that starts from 1 and increments by 2 for each row.

In [11]:
import pandas as pd

In [43]:
data={'A':[1,2,3],
      'B':[4,5,6],
      'C':[7,8,9]
}

In [44]:
df=pd.DataFrame(data)

In [45]:
def reindex_dataframe(df):
    new_index=pd.Series(range(1,2*len(df)+1,2))
    df=df.reset_index(drop=True)
    df.index=new_index
    
    return df

In [46]:

new_df=reindex_dataframe(df)
print(new_df)

   A  B  C
1  1  4  7
3  2  5  8
5  3  6  9

In [ ]:
Q3. You have a Pandas DataFrame df with a column named 'Values'. Write a Python function that
iterates over the DataFrame and calculates the sum of the first three values in the 'Values' column. The
function should print the sum to the console.
For example, if the 'Values' column of df contains the values [10, 20, 30, 40, 50], your function should
calculate and print the sum of the first three values, which is 60.

In [5]:
import pandas as pd

In [2]:
pip install pandas

Requirement already satisfied: pandas in /opt/conda/lib/python3.10/site-packages (1.5.2)
Requirement already satisfied: python-dateutil>=2.8.1 in /opt/conda/lib/python3.10/site-packages (from pandas) (2.8.2)
Requirement already satisfied: pytz>=2020.1 in /opt/conda/lib/python3.10/site-packages (from pandas) (2022.6)
Requirement already satisfied: numpy>=1.21.0 in /opt/conda/lib/python3.10/site-packages (from pandas) (1.23.5)
Requirement already satisfied: six>=1.5 in /opt/conda/lib/python3.10/site-packages (from python-dateutil>=2.8.1->pandas) (1.16.0)
Note: you may need to restart the kernel to use updated packages.

In [2]:
data={'values':[10,20,30,40,50]}

In [6]:
df=pd.DataFrame(data)

In [13]:
def calculate_sum(df):
    values_column=df['values']
    
    
    sum_of_three_values=values_column.head(3).sum()
    print("sum of three values in the 'values' column:",sum_of_three_values)
      
calculate_sum(df)

sum of three values in the 'values' column: 60

In [ ]:
Q4. Given a Pandas DataFrame df with a column 'Text', write a Python function to create a new column
'Word_Count' that contains the number of words in each row of the 'Text' column.

In [23]:
import pandas as pd


data = {'Text': ['raju', 'Python', 'Data Science']}
df = pd.DataFrame(data)

def count_words(df):
    df['Word_Count'] = df['Text'].apply(lambda x: len(x.split()))
    return df


df = count_words(df)
print(df)

           Text  Word_Count
0          raju           1
1        Python           1
2  Data Science           2

In [ ]:
Q5. How are DataFrame.size() and DataFrame.shape() different?

In [25]:
import pandas as pd

data={'column1':[1,2,3],
      'column2':["R","S","T"]
     }
df=pd.DataFrame(data)

print(df.size)

6

In [26]:
import pandas as pd

data={'column1':[1,2,3],
      'column2':["R","S","T"]
     }
df=pd.DataFrame(data)

print(df.shape)

(3, 2)

In [ ]:
Q6. Which function of pandas do we use to read an excel file?

In [ ]:
pd.read_excel(excel full name)

In [ ]:
Q7. You have a Pandas DataFrame df that contains a column named 'Email' that contains email
addresses in the format 'username@domain.com'. Write a Python function that creates a new column
'Username' in df that contains only the username part of each email address.

In [33]:
import pandas as pd 

data={'Email':["username@domain.com"]}
df=pd.DataFrame(data)

def user_name(df):
    new_column=df['Email']
    return(df)

df=user_name(df)
print(df)

                 Email
0  username@domain.com

In [ ]:
column.

Q8. You have a Pandas DataFrame df with columns 'A', 'B', and 'C'. Write a Python function that selects
all rows where the value in column 'A' is greater than 5 and the value in column 'B' is less than 10. The
function should return a new DataFrame that contains only the selected rows.
For example, if df contains the following values:
A B C
0 3 5 1
1 8 2 7
2 6 9 4
3 2 3 5
4 9 1 2

Your function should select the following rows: A B C
1 8 2 7
4 9 1 2
The function should return a new DataFrame that contains only the selected rows.

In [4]:
import pandas as pd
data1=pd.DataFrame({'A':[3,8,6,2,9],
                    'B':[5,2,9,3,1],
                    'C':[1,7,4,5,2]})

In [5]:
data1

   A  B  C
0  3  5  1
1  8  2  7
2  6  9  4
3  2  3  5
4  9  1  2

In [3]:
data1.columns

Index(['a', 'b', 'c'], dtype='object')

In [7]:
def cate_column(data1):
    filter_data=data1[(data1['A']>5) & (data1['B']<10)]
    return filter_data

cate_column=cate_column(data1)
print(cate_column)

   A  B  C
1  8  2  7
2  6  9  4
4  9  1  2

In [ ]:
Q9. Given a Pandas DataFrame df with a column 'Values', write a Python function to calculate the mean,
median, and standard deviation of the values in the 'Values' column.

In [9]:
data2=pd.DataFrame({'A':[3,8,6,2,9],
                    'B':[5,2,9,3,1],
                    'C':[1,7,4,5,2]})

In [10]:
data2

   A  B  C
0  3  5  1
1  8  2  7
2  6  9  4
3  2  3  5
4  9  1  2

In [12]:
data2.mean()

A    5.6
B    4.0
C    3.8
dtype: float64

In [13]:
data2.median()

A    6.0
B    3.0
C    4.0
dtype: float64

In [ ]:
Q10. Given a Pandas DataFrame df with a column 'Sales' and a column 'Date', write a Python function to
create a new column 'MovingAverage' that contains the moving average of the sales for the past 7 days
for each row in the DataFrame. The moving average should be calculated using a window of size 7 and
should include the current day.

In [9]:
import pandas as pd

In [17]:
date1=pd.date_range(start='2023-10-28' , end='2023-11-05')

In [18]:
date1

DatetimeIndex(['2023-10-28', '2023-10-29', '2023-10-30', '2023-10-31',
               '2023-11-01', '2023-11-02', '2023-11-03', '2023-11-04',
               '2023-11-05'],
              dtype='datetime64[ns]', freq='D')

In [ ]:
Q11. You have a Pandas DataFrame df with a column 'Date'. Write a Python function that creates a new
column 'Weekday' in the DataFrame. The 'Weekday' column should contain the weekday name (e.g.
Monday, Tuesday) corresponding to each date in the 'Date' column.

In [2]:
import pandas as pd

In [7]:
date={'date':['23-01-01','23-01-02','23-01-03','23-01-04','23-01-05']}

In [8]:
df=pd.DataFrame(date)

In [9]:
df

       date
0  23-01-01
1  23-01-02
2  23-01-03
3  23-01-04
4  23-01-05

In [10]:
df2=pd.DataFrame({'weekday':['sunday','monday','tuesday','wednesday','thursday']})

In [11]:
df2

     weekday
0     sunday
1     monday
2    tuesday
3  wednesday
4   thursday

In [12]:
df.join(df2)

       date    weekday
0  23-01-01     sunday
1  23-01-02     monday
2  23-01-03    tuesday
3  23-01-04  wednesday
4  23-01-05   thursday

In [ ]:
Q12. Given a Pandas DataFrame df with a column 'Date' that contains timestamps, write a Python
function to select all rows where the date is between '2023-01-01' and '2023-01-31'.

In [21]:
import pandas as pd

data = {'Date': ['2023-01-13', '2023-01-04', '2023-02-09', '2023-01-21', '2023-03-08']}
df = pd.DataFrame(data)
df['Date'] = pd.to_datetime(df['Date']) 

def filter_by_date(input_df):
    filtered_df = input_df[(input_df['Date'] >= '2023-01-01') & (input_df['Date'] <= '2023-01-31')]
    return filtered_df


filtered_df = filter_by_date(df)
print(filtered_df)

        Date
0 2023-01-15
1 2023-01-05
3 2023-01-20